testFiles/results_one_thread_6GB_bench/memtier_oomd_yes_throttle.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:       45701 ops,    1110 (avg:    1140) ops/sec, 807.89MB/sec (avg: 830.19MB/sec), 399.86 (avg: 438.52) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          104.84          ---          ---       454.20257       444.41500       638.97500       667.64700    858885.33 
Gets         1043.06         0.00      1043.06       436.93518       458.75100       667.64700       696.31900        40.65 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1147.91         0.00      1043.06       438.50659       458.75100       663.55100       692.22300    858925.98 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET      36.863        0.000
SET     356.351        5.000
SET     374.783       10.000
SET     389.119       15.000
SET     397.311       20.000
SET     405.503       25.000
SET     413.695       30.000
SET     421.887       35.000
SET     428.031       40.000
SET     436.223       45.000
SET     444.415       50.000
SET     448.511       52.500
SET     452.607       55.000
SET     458.751       57.500
SET     462.847       60.000
SET     468.991       62.500
SET     473.087       65.000
SET     481.279       67.500
SET     487.423       70.000
SET     495.615       72.500
SET     503.807       75.000
SET     505.855       76.250
SET     509.951       77.500
SET     514.047       78.750
SET     516.095       80.000
SET     520.191       81.250
SET     524.287       82.500
SET     528.383       83.750
SET     532.479       85.000
SET     540.671       86.250
SET     544.767       87.500
SET     548.863       88.125
SET     552.959       88.750
SET     552.959       89.375
SET     557.055       90.000
SET     561.151       90.625
SET     565.247       91.250
SET     569.343       91.875
SET     573.439       92.500
SET     577.535       93.125
SET     581.631       93.750
SET     581.631       94.062
SET     585.727       94.375
SET     585.727       94.688
SET     589.823       95.000
SET     589.823       95.312
SET     593.919       95.625
SET     598.015       95.938
SET     602.111       96.250
SET     606.207       96.562
SET     610.303       96.875
SET     610.303       97.031
SET     610.303       97.188
SET     614.399       97.344
SET     614.399       97.500
SET     618.495       97.656
SET     618.495       97.812
SET     622.591       97.969
SET     622.591       98.125
SET     626.687       98.281
SET     626.687       98.438
SET     630.783       98.516
SET     630.783       98.594
SET     630.783       98.672
SET     634.879       98.750
SET     634.879       98.828
SET     634.879       98.906
SET     638.975       98.984
SET     638.975       99.062
SET     638.975       99.141
SET     643.071       99.219
SET     643.071       99.258
SET     643.071       99.297
SET     643.071       99.336
SET     647.167       99.375
SET     647.167       99.414
SET     647.167       99.453
SET     647.167       99.492
SET     647.167       99.531
SET     651.263       99.570
SET     651.263       99.609
SET     651.263       99.629
SET     651.263       99.648
SET     655.359       99.668
SET     655.359       99.688
SET     655.359       99.707
SET     655.359       99.727
SET     655.359       99.746
SET     655.359       99.766
SET     659.455       99.785
SET     659.455       99.805
SET     659.455       99.814
SET     659.455       99.824
SET     659.455       99.834
SET     659.455       99.844
SET     659.455       99.854
SET     663.551       99.863
SET     663.551       99.873
SET     667.647       99.883
SET     667.647       99.893
SET     667.647       99.902
SET     667.647       99.907
SET     667.647       99.912
SET     667.647       99.917
SET     667.647       99.922
SET     667.647       99.927
SET     671.743       99.932
SET     671.743       99.937
SET     671.743       99.941
SET     671.743       99.946
SET     671.743       99.951
SET     671.743       99.954
SET     671.743       99.956
SET     671.743       99.958
SET     671.743       99.961
SET     671.743       99.963
SET     671.743       99.966
SET     671.743       99.968
SET     671.743       99.971
SET     671.743       99.973
SET     671.743       99.976
SET     679.935       99.977
SET     679.935      100.000
---
GET       0.351        0.000
GET      59.647        5.000
GET     166.911       10.000
GET     376.831       15.000
GET     397.311       20.000
GET     411.647       25.000
GET     421.887       30.000
GET     432.127       35.000
GET     440.319       40.000
GET     450.559       45.000
GET     458.751       50.000
GET     464.895       52.500
GET     468.991       55.000
GET     475.135       57.500
GET     479.231       60.000
GET     485.375       62.500
GET     491.519       65.000
GET     497.663       67.500
GET     503.807       70.000
GET     509.951       72.500
GET     518.143       75.000
GET     522.239       76.250
GET     528.383       77.500
GET     532.479       78.750
GET     536.575       80.000
GET     544.767       81.250
GET     548.863       82.500
GET     557.055       83.750
GET     561.151       85.000
GET     569.343       86.250
GET     573.439       87.500
GET     577.535       88.125
GET     581.631       88.750
GET     585.727       89.375
GET     589.823       90.000
GET     589.823       90.625
GET     593.919       91.250
GET     598.015       91.875
GET     602.111       92.500
GET     606.207       93.125
GET     610.303       93.750
GET     610.303       94.062
GET     614.399       94.375
GET     618.495       94.688
GET     618.495       95.000
GET     622.591       95.312
GET     626.687       95.625
GET     626.687       95.938
GET     630.783       96.250
GET     634.879       96.562
GET     638.975       96.875
GET     638.975       97.031
GET     643.071       97.188
GET     643.071       97.344
GET     643.071       97.500
GET     647.167       97.656
GET     647.167       97.812
GET     651.263       97.969
GET     651.263       98.125
GET     655.359       98.281
GET     655.359       98.438
GET     659.455       98.516
GET     659.455       98.594
GET     659.455       98.672
GET     663.551       98.750
GET     663.551       98.828
GET     663.551       98.906
GET     667.647       98.984
GET     667.647       99.062
GET     667.647       99.141
GET     671.743       99.219
GET     671.743       99.258
GET     671.743       99.297
GET     671.743       99.336
GET     675.839       99.375
GET     675.839       99.414
GET     675.839       99.453
GET     675.839       99.492
GET     675.839       99.531
GET     679.935       99.570
GET     679.935       99.609
GET     679.935       99.629
GET     679.935       99.648
GET     684.031       99.668
GET     684.031       99.688
GET     684.031       99.707
GET     684.031       99.727
GET     684.031       99.746
GET     684.031       99.766
GET     684.031       99.785
GET     688.127       99.805
GET     688.127       99.814
GET     688.127       99.824
GET     688.127       99.834
GET     688.127       99.844
GET     692.223       99.854
GET     692.223       99.863
GET     692.223       99.873
GET     692.223       99.883
GET     696.319       99.893
GET     696.319       99.902
GET     696.319       99.907
GET     696.319       99.912
GET     704.511       99.917
GET     704.511       99.922
GET     704.511       99.927
GET     704.511       99.932
GET     712.703       99.937
GET     712.703       99.941
GET     712.703       99.946
GET     712.703       99.951
GET     712.703       99.954
GET     712.703       99.956
GET     720.895       99.958
GET     720.895       99.961
GET     720.895       99.963
GET     720.895       99.966
GET     720.895       99.968
GET     720.895       99.971
GET     720.895       99.973
GET     720.895       99.976
GET     720.895       99.977
GET     720.895       99.978
GET     770.047       99.979
GET     770.047      100.000
---
WAIT      0.000      100.000